///  Что такое AJAX?
// AJAX или Asyncronous JavaScript and XML — это набор взаимосвязанных технологий, которые позволяют работать с данными в асинхронном режиме. Это означает, что мы можем отправлять данные на сервер и получать данные с него без перезагрузки веб-страницы.

// AJAX использует следующие технологии:
// HTML — структура веб-страницы.
// CSS — стили веб-страницы.
// JavaScript — поведение страницы и работа с DOM.
// XMLHttpRequest API — отправка и получение данных с сервера.
// PHP, Python, Nodejs — какой-нибудь серверный язык.


